IDEA StatiCa Open Model
RebarGeneral.RebarType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Rebar type
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public RebarGeneralType RebarType { get; set; }
Public Property RebarType As RebarGeneralType
	Get
	Set
public:
property RebarGeneralType RebarType {
	RebarGeneralType get ();
	void set (RebarGeneralType value);
}
Property Value
Type: RebarGeneralType
See Also
Reference
RebarGeneral Class
IdeaRS.OpenModel.Model Namespace